/*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
* 文件名  ： intp
* 作者    ： xuxinjie
* 版本    ： V0.0.1
* 时间    ： 2020/11/10
* 描述    ： 按键外部中断驱动系统
********************************************************************
* 副本
*
*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>*/
/* 头文件 ----------------------------------------------------------------*/
#include"intp.h"  
#include"led.h"
#include"key.h"
/* 宏定义 ----------------------------------------------------------------*/
/* 结构体或枚举 ----------------------------------------------------------*/
/* 内部函数声明-----------------------------------------------------------*/

/* 函数 ------------------------------------------------------------------*/
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 函数名  ： IntpInit
* 参数    ： void
* 返回    ： void
* 作者    ： xuxinjie
* 时间    ： 2020/11/10
* 描述    ： 按键中断初始化 KEY1 P0_1 KEY2 P2_0
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void IntpInit(void)
{
    //KEY1 使能总中断
    EA =1;
    //使能组中断
    P0IE = 1;
    //使能子中断
    P0IEN |=0x02;
    //设置为下降沿触发中断
    PICTL |=0x01;
    
    //KEY2 使能总中断
    EA =1;
    //使能组中断
    IEN2 |= 0x02;
    //使能子中断
    P2IEN |=0x10;
    //设置为下降沿触发中断
    PICTL |=0x08;
    
}
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 函数名  ： P0_ISR
* 参数    ： void
* 返回    ： void
* 作者    ： xuxinjie
* 时间    ： 2020/11/10
* 描述    ： 按键1的中断服务程序
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
#pragma vector = P0INT_VECTOR
__interrupt void P0_ISR(void)
{
    //判断是否为KEY1  P0_1的引脚发生中断
    if (P0IFG & 0x02)
    {
        if ( KEY_PRESS == KeyStateGet( KEY_KEY1_E ) )
        {
            //消除抖动
            Delay(100);
            if( KEY_PRESS == KeyStateGet( KEY_KEY1_E ) )
            {
                LedToggle(LED_LED1_E);
                void Clock32MInit();
                //等待按键松开
                while( KEY_PRESS == KeyStateGet( KEY_KEY1_E ) );
            }
        }
    }
    
}
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 函数名  ： P2_ISR
* 参数    ： void
* 返回    ： void
* 作者    ： xuxinjie
* 时间    ： 2020/11/10
* 描述    ： 按键2的中断服务程序
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
#pragma vector = P2INT_VECTOR
__interrupt void P2_ISR(void)
{
       //判断是否为KEY1  P0_1的引脚发生中断
    if (P2IFG & 0x10)
    {
        if ( KEY_PRESS == KeyStateGet( KEY_KEY2_E ) )
        {
            //消除抖动
            Delay(100);
            if( KEY_PRESS == KeyStateGet( KEY_KEY2_E ) )
            {
                LedToggle(LED_LED2_E);
                void Clock16MInit();
                //等待按键松开
                while( KEY_PRESS == KeyStateGet( KEY_KEY2_E ) );
            }
        }
    }
    
}

