/*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
* 文件名  ：key
* 作者    ：xuxinjie
* 版本    ：V0.0.1
* 时间    ：2020/10/27
* 描述    ：按键驱动文件
********************************************************************
* 副本
*
*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>*/

/* 头文件 ----------------------------------------------------------------*/
#include"key.h"
/* 宏定义 ----------------------------------------------------------------*/
#define KEY1 P0_1
#define KEY2 P2_0
/* 结构体或枚举 ----------------------------------------------------------------*/
/* 内部函数声明 ----------------------------------------------------------------*/


/* 函数 ----------------------------------------------------------------*/

/*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
* 函数名  ：KeyInit
* 参数    ：void
* 返回    ：void
* 作者    ：xuxinjie
* 时间    ：2020/10/27
* 描述    ：按键初始化
----------------------------------------------------------------*/
void  KeyInit(void)
{
  //设置对应IO为通用IO
  P0SEL &= 0xFD;
  P2SEL &= 0xFE;
  
  //设置对应IO为输入
  P0DIR &= 0xFD;
  P2DIR &= 0xFE;
  
  //设置对应IO为上拉模式/三态
  P0INP &= 0xFD;
  P2INP &= 0x5E;
}

/*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
* 函数名  ：KeyStateGet
* 参数    ：unsigned char ucKeyNum  1 KEY1 2 KEY2
* 返回    ：unsigned char  0 按下  1 松开 
* 作者    ：xuxinjie
* 时间    ：2020/10/27
* 描述    ：获取按键状态
----------------------------------------------------------------*/
unsigned char  KeyStateGet(unsigned char ucKeyNum)
{
  unsigned char ucKeyState;
 if( KEY_KEY1_E == ucKeyNum )
 {
   ucKeyState = P0_1;
 }
 else if( KEY_KEY2_E == ucKeyNum )
 {
   ucKeyState = P0_2;
 }
 else
 {
   ucKeyState = KEY_ERROR;
 }
 return ucKeyState;
  
  
}