/*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
* 文件名  ： timer
* 作者    ： xuxinjie
* 版本    ： V0.0.1
* 时间    ： 2020/12/1
* 描述    ： 定时器驱动头文件 
********************************************************************
* 副本
*
*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>*/
#ifndef _TIMER_H  
#define _TIMER_H

/* 头文件 ----------------------------------------------------------------*/
#include<iocc2530.h>
/* 宏定义 ----------------------------------------------------------------*/
#define TIMERSET(t, val)  \
    (t) = g_ulSysClock + (unsigned long)(val)
#define TIMERCHECK(t)     \
    ( (unsigned long) ( (long)g_ulSysClock - (long)(t) ) < (unsigned long)( (~( (unsigned long)0) ) >> 1) )
/* 结构体或枚举 ----------------------------------------------------------*/
/* 函数声明---------------------------------------------------------------*/
void TimerInit(void);
__interrupt void T1_ISR(void);
/* 外部变量引用 ----------------------------------------------------------*/
 extern unsigned long g_ulSysClock;
#endif // _TIMER_H   

